#+PROPERTY: bucket_ALL a b
* category I
** context 1
:PROPERTIES:
:bucket:   a
:END:
*** task A
:LOGBOOK:
CLOCK: [2018-02-23 Fri 12:00]--[2018-02-23 Fri 13:00] =>  1:00
:END:
*** task B
:LOGBOOK:
CLOCK: [2018-02-23 Fri 13:00]--[2018-02-23 Fri 14:00] =>  1:00
:END:
** context 2
:PROPERTIES:
:bucket:   b
:END:
*** task A
:PROPERTIES:
:bucket:   a
:END:
:LOGBOOK:
CLOCK: [2018-02-23 Fri 14:00]--[2018-02-23 Fri 15:00] =>  1:00
:END:
*** task B
:LOGBOOK:
CLOCK: [2018-02-23 Fri 15:00]--[2018-02-23 Fri 16:00] =>  1:00
:END:
* category II
** context 1
:PROPERTIES:
:bucket:   b
:END:
*** task A
:LOGBOOK:
CLOCK: [2018-02-23 Fri 15:00]--[2018-02-23 Fri 16:00] =>  1:00
:END:
*** task B
:PROPERTIES:
:bucket:   a
:END:
:LOGBOOK:
CLOCK: [2018-02-23 Fri 16:00]--[2018-02-23 Fri 17:00] =>  1:00
:END:
*** task C
:PROPERTIES:
:bucket:   c
:END:
:LOGBOOK:
CLOCK: [2018-02-23 Fri 17:00]--[2018-02-23 Fri 18:00] =>  1:00
:END:
*** task D
:PROPERTIES:
:bucket:   d
:END:
:LOGBOOK:
CLOCK: [2018-02-23 Fri 18:00]--[2018-02-23 Fri 19:00] =>  1:00
:END:
*** task E
:LOGBOOK:
CLOCK: [2018-02-23 Fri 18:00]--[2018-02-23 Fri 18:00] =>  0:00
:END:
